package Commands;

import Interfaces.Command;

public class Help implements Command <Void, String>{
    public Void run(String[] args){
        System.out.println("Общи операции:\n" +
                "  open <файл>          – зарежда или създава нов файл с данни\n" +
                "  close                – затваря текущия файл\n" +
                "  save                 – запазва промените в текущия файл\n" +
                "  saveas <ново_име>    – запазва текущите данни в нов файл\n" +
                "  help                 – показва тази справка\n" +
                "  exit                 – излиза от програмата\n" +
                "\n" +
                "Операции с представления:\n" +
                "  addevent <date> <hall> <name>\n" +
                "       Добавя ново представление на дата <date> в зала <hall> с име <name>.\n" +
                "       Ако на тази дата в залата вече има друго представление, командата връща грешка.\n" +
                "\n" +
                "  freeseats <date> <name>\n" +
                "       Извежда справка за свободните места (непродадени и незапазени) за представление\n" +
                "       с име <name> на дата <date>.\n" +
                "\n" +
                "  book <row> <seat> <date> <name> [<note>]\n" +
                "       Резервира (запазва) билет на ред <row> и място <seat> за представление\n" +
                "       с име <name> на дата <date>. Можете да добавите и бележка <note>.\n" +
                "\n" +
                "  unbook <row> <seat> <date> <name>\n" +
                "       Отменя резервация (запазен билет) на ред <row> и място <seat> за представление\n" +
                "       с име <name> на дата <date>.\n" +
                "\n" +
                "  buy <row> <seat> <date> <name>\n" +
                "       Изкупува (закупува) билет на ред <row> и място <seat> за представление\n" +
                "       с име <name> на дата <date>. За всеки билет се генерира уникален код.\n" +
                "\n" +
                "Справки:\n" +
                "  bookings [<date>] [<name>]\n" +
                "       Извежда списък на незаплатените (запазени) билети. \n" +
                "       Ако зададете <date> и/или <name>, филтрира по тях.\n" +
                "\n" +
                "  check <code>\n" +
                "       Проверява валидността на билет по неговия код <code>. \n" +
                "       Ако е валиден – връща ред и място, иначе – грешка.\n" +
                "\n" +
                "  report <from> <to> [<hall>]\n" +
                "       Извежда статистика за продадени билети от дата <from> до <to>.\n" +
                "       Ако е зададена <hall>, филтрира по дадената зала, иначе – всички зали.\n" +
                "\n" +
                "Бонус функции :\n" +
                "  - statisticsTop           – статистика за най-гледаните представления\n" +
                "  - statisticsLow_occupancy <from> <to>  – представя списък на представления с под 10% заетост във\n" +
                "                                          периода и възможност за изтриване на тези записи");
        return null;
    }
}
